namespace PocketBank.User.WebApi.Common.Validation.Regexes
{
    public static class RegexConstants
    {
        public static class ClientRegexes
        {
            public static readonly string 
                Name = "^[A-ZА-Я](([a-zA-Zа-яА-Я\\s'-]*[a-zA-Zа-яА-Я])|[a-zA-Zа-яА-Я]*)$",
                Middlename = "^([A-ZА-Я](([a-zA-Zа-яА-Я\\s'-]*[a-zA-Zа-яА-Я])|[a-zA-Zа-яА-Я]*))?$",
                Passport = "(?=.*\\d)+^[\\dA-Z]*$",
                Password = "^((?=.*[a-z])(?=.*[A-Z])(?=.*\\d)[A-Za-z\\d])|((?=.*[a-z])(?=.*[A-Z])(?=.*[!#$%&'()*+,-.\\/:;<=>?@[\\\\\\]^_`{|}~])[A-Za-z!#$%&'()*+,-.\\/:;<=>?@[\\\\\\]^_`{|}~])|((?=.*[a-z])(?=.*\\d)(?=.*[!#$%&'()*+,-.\\/:;<=>?@[\\\\\\]^_`{|}~])[a-z\\d!#$%&'()*+,-.\\/:;<=>?@[\\\\\\]^_`{|}~])|((?=.*[A-Z])(?=.*\\d)(?=.*[!#$%&'()*+,-.\\/:;<=>?@[\\\\\\]^_`{|}~])[A-Z\\d!#$%&'()*+,-.\\/:;<=>?@[\\\\\\]^_`{|}~])|((?=.*[a-z])(?=.*[A-Z])(?=.*\\d)(?=.*[!#$%&'()*+,-.\\/:;<=>?@[\\\\\\]^_`{|}~])[A-Za-z\\d!#$%&'()*+,-.\\/:;<=>?@[\\\\\\]^_`{|}~])$";
        }
    }
}
